www/lrn/lisp/lisp-6.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f222cf">План работ</a></li>
<li><a href="#org2228c93">Глобальное окружение</a></li>
<li><a href="#orgda5e251">Функции для тестирования</a></li>
<li><a href="#org2618622">Структура замыкания</a></li>
<li><a href="#org0bc8968">MyApply</a>
<ul>
<li><a href="#orgbf025b5">Работа с CONS-ячейками</a></li>
<li><a href="#org319a1bb">NULL-предикат</a></li>
<li><a href="#org7449f49">Встроенные функции арифметики</a></li>
<li><a href="#org55c006e">CLOSURE</a></li>
<li><a href="#orgc383a66">PRINT</a></li>
<li><a href="#org6082cf9">LIST</a></li>
</ul>
</li>
<li><a href="#orgf1b0933">MyEval</a>
<ul>
<li><a href="#org03bfd34">Самовычисляемые формы</a></li>
<li><a href="#org16a712f">Вычисление символов</a></li>
<li><a href="#orge6ea061">Цитирование</a></li>
<li><a href="#org5652de3">Условное выполнение IF</a></li>
<li><a href="#org9808676">COND</a></li>
<li><a href="#org8ea7eca">PROGN</a></li>
<li><a href="#orgb1d032f">AND</a></li>
<li><a href="#org74bc558">OR</a></li>
<li><a href="#org520a145">LET</a></li>
<li><a href="#org50af98e">LET*</a></li>
<li><a href="#org4da2794">DEFUN</a></li>
<li><a href="#org239ed27">SETQ</a></li>
<li><a href="#orgc5fc60a">LAMBDA</a></li>
<li><a href="#org07e2990">BLOCK</a></li>
<li><a href="#org9922c91">RETURN-FROM</a></li>
<li><a href="#org4eb1d51">CATCH</a></li>
<li><a href="#orgfcf6b2c">THROW</a></li>
<li><a href="#org62214f4">TAGBODY</a></li>
<li><a href="#org15eb5a4">GO</a></li>
</ul>
</li>
<li><a href="#orgd6be9f9">REPL</a></li>
<li><a href="#orgefa6b6f">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9f222cf" class="outline-2">
<h2 id="org9f222cf">План работ</h2>
<div class="outline-text-2" id="text-org9f222cf">
<p>
Цель этого этапа: расширить интерпретатор конструкциями <code>tagbody</code> и <code>go</code>. Для этого мы
заведем еще один специальный вид окружения <code>go-env</code>, который будем использовать также,
как и остальные окружения.
</p>
</div>
</div>

<div id="outline-container-org2228c93" class="outline-2">
<h2 id="org2228c93">Глобальное окружение</h2>
<div class="outline-text-2" id="text-org2228c93">
<div class="org-src-container">
<pre class="src src-lisp" id="orgb3b08bd">(defun assoc-2 (key alist cont errcont) ;; NB!: inverted order of
                                        ;; continuations (for lookup)
  (cond ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgceb0b72">(assert (equal "ok:123"
               (assoc-2 'alfa '((alfa . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
(assert (equal "err:ALFA"
               (assoc-2 'alfa '((beta . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org8b83bef">;; environment
(defparameter *glob-env* nil)
;; lookup
(defun lookup (symb env errcont cont)
  (assoc-2 symb env cont
           (lambda (key)
             (assoc-2 key *glob-env* cont
                      (lambda (key)
                        (funcall errcont
                                 (format
                                  nil
                                  "UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"
                                  key env *glob-env*)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org9668579">;; test lookup
(assert (equal "ok:123" (lookup 'aaa '((aaa . 123))
                                (lambda (x) (format nil "err:~A" x))
                                (lambda (x) (format nil "ok:~A" x)))))
(assert (equal nil      (lookup 'aaa '((bbb . 123))
                                (lambda (x) (declare (ignore x)) nil)
                                (lambda (x) (format nil "ok:~A" x)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda5e251" class="outline-2">
<h2 id="orgda5e251">Функции для тестирования</h2>
<div class="outline-text-2" id="text-orgda5e251">
<div class="org-src-container">
<pre class="src src-lisp" id="org9c85ad5">(defun ok (x)
  (format t "~%ok: ~A" x)
  x)
(defun err (x)
  (format t "~%err: ~A" x)
  x)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2618622" class="outline-2">
<h2 id="org2618622">Структура замыкания</h2>
<div class="outline-text-2" id="text-org2618622">
<p>
Добавляем <code>go-env</code>, чтобы иметь возможность лексически его замыкать.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org402606a">(defstruct closure
  body
  env
  block-env
  go-env
  args)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bc8968" class="outline-2">
<h2 id="org0bc8968">MyApply</h2>
<div class="outline-text-2" id="text-org0bc8968">
<div class="org-src-container">
<pre class="src src-lisp" id="org2d3ddc8">(define-condition unknown-function (error)
  ((fn :initarg :fn  :reader fn))
  (:report
   (lambda (condition stream)
     (format stream "Error in MYAPPLY: unknown-function: ~A"
             (fn condition)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgeaf09de">&lt;&lt;evaddmul_6&gt;&gt;
&lt;&lt;evlis_6&gt;&gt;
(defun myapply (fn args catch-env errcont cont)
  (cond
    &lt;&lt;myapply_car_cdr_cons_6&gt;&gt;
    &lt;&lt;myapply_null_6&gt;&gt;
    &lt;&lt;myapply_ariph_6&gt;&gt;
    &lt;&lt;myapply_closure_6&gt;&gt;
    &lt;&lt;myapply_print_6&gt;&gt;
    &lt;&lt;myapply_list_6&gt;&gt;
    (t (error 'unknown-function :fn fn))))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-lisp" id="org1e44267">&lt;&lt;myapply_car_cdr_cons_6_test&gt;&gt;
&lt;&lt;myapply_null_6_test&gt;&gt;
&lt;&lt;evaddmul_6_test&gt;&gt;
&lt;&lt;myapply_ariph_6_test&gt;&gt;
&lt;&lt;myapply_closure_6_test&gt;&gt;
&lt;&lt;myapply_print_6_test&gt;&gt;
&lt;&lt;myapply_evlis_6_test&gt;&gt;
&lt;&lt;myapply_list_6_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-orgbf025b5" class="outline-3">
<h3 id="orgbf025b5">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-orgbf025b5">
<div class="org-src-container">
<pre class="src src-lisp" id="org8eb3c03">((equal fn 'car)             (funcall cont (caar args)))
((equal fn 'cdr)             (funcall cont (cdar args)))
((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
</pre>
</div>

<p>
Добавляем еще один nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org6f13abe">;; Тесты cons, car, cdr
(assert (equal '(1 . 2) (myeval '(cons 1 2) nil nil nil nil #'err #'ok)))
(assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(car (cons 2 3)) nil nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(cdr (cons 2 3)) nil nil nil nil #'err #'ok)))
(assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
(assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
;; Тесты для cons-ячеек, вычисляемых в окружении
(assert (equal 1 (myeval '(car a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
