www/lrn/lisp/lisp-6.html

<div id="outline-container-orge6ea061" class="outline-3">
<h3 id="orge6ea061">Цитирование</h3>
<div class="outline-text-3" id="text-orge6ea061">
<div class="org-src-container">
<pre class="src src-lisp" id="org1a526bd">((equal (car exp) 'quote)    (funcall cont (cadr exp)))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgf888c83">;; Тесты для QUOTE
(assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5652de3" class="outline-3">
<h3 id="org5652de3">Условное выполнение IF</h3>
<div class="outline-text-3" id="text-org5652de3">
<p>
Пробрасываем <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org29e3b1c">((equal (car exp) 'if)       (myeval (cadr exp) env block-env go-env catch-env errcont
                                     (lambda (x)
                                       (if x
                                           (myeval (caddr exp)
                                                   env block-env go-env catch-env
                                                   errcont cont)
                                           (myeval (cadddr exp)
                                                   env block-env go-env catch-env
                                                   errcont cont)))))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgf304b40">;; Тесты для IF
(assert (equal 2 (myeval '(if () 1 2) nil nil nil nil #'err #'ok)))
(assert (equal 1 (myeval '(if (null ()) 1 2) nil nil nil nil #'err #'ok)))
;; Тесты для IF, где условие вычисляется в окружении
(assert (equal 2 (myeval '(if a 1 2) '((a . ())) nil nil nil #'err #'ok)))
(assert (equal 1 (myeval '(if a 1 2) '((a . 1)) nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9808676" class="outline-3">
<h3 id="org9808676">COND</h3>
<div class="outline-text-3" id="text-org9808676">
<p>
Пробрасываем <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org761062e">(defun evcond (exp env block-env go-env catch-env errcont cont)
  (cond ((null exp)  (funcall cont nil))
        (t           (myeval (caar exp) env block-env go-env catch-env errcont
                             (lambda (x)
                               (if x
                                   (myeval (cadar exp)
                                           env block-env go-env catch-env
                                           errcont cont)
                                   (evcond (cdr exp)
                                           env block-env go-env catch-env
                                           errcont cont)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org5bb6ab9">;; Тесты для EVCOND
(assert (equal 2   (evcond '((t 2)   (t 1)) nil nil nil nil #'err #'ok)))
(assert (equal 1   (evcond '((nil 2) (t 1)) nil nil nil nil #'err #'ok)))
(assert (equal nil (evcond '((nil 2) (nil 1)) nil nil nil nil #'err #'ok)))
;; Тесты для EVCOND, где участвует окружение
(assert (equal 2 (evcond '((a 2) (b 1))
                         '((a . 1) (b . ()))
                         nil nil nil #'err #'ok)))
(assert (equal 1 (evcond '((a 2) (b 1))
                         '((a . nil) (b . T))
                         nil nil nil #'err #'ok)))
</pre>
</div>

<p>
и адаптируем вызов внутри <code>myeval</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org532a983">((equal (car exp) 'cond)     (evcond (cdr exp)
                                     env block-env go-env catch-env
                                     errcont cont))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgabfac80">;; Тесты для COND
(assert (equal 2 (myeval '(cond
                           (() 1)
                           (1 2))
                         nil nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(cond
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1))
                         nil nil nil #'err #'ok)))
(assert (equal 1 (myeval '(cond
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ()))
                         nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ea7eca" class="outline-3">
<h3 id="org8ea7eca">PROGN</h3>
<div class="outline-text-3" id="text-org8ea7eca">
<p>
Пробрасываем <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org7096fda">(defun evprogn (lst env block-env go-env catch-env errcont cont)
  (cond ((null lst)         (funcall cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env go-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env go-env catch-env errcont
                                    (lambda (x)
                                      (evprogn (cdr lst)
                                               env block-env go-env catch-env
                                               errcont cont))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org91400f0">;; Тест для EVPROGN
(assert (equal 2 (evprogn '(1 2) nil nil nil nil  #'err #'ok)))
;; Тест для EVPROGN в окружении
(assert (equal 3 (evprogn '(a b c)
                          '((a . 1) (b . 2) (c . 3))
                           nil nil nil #'err #'ok)))
</pre>
</div>

<p>
модифицируем вызов в <code>myeval</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb032c65">((equal (car exp) 'progn)    (evprogn (cdr exp)
                                      env block-env go-env catch-env
                                      errcont cont))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgdbcf715">;; Тест для PROGN
(assert (equal 3 (myeval '(progn 1 2 3) nil nil nil nil #'err #'ok)))
;; Тест для PROGN в окружении
(assert (equal 3 (myeval '(progn a b c) '((a . 1) (b . 2) (c . 3))
                         nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
