www/lrn/lisp/lisp-6.html

<div id="outline-container-org4da2794" class="outline-3">
<h3 id="org4da2794">DEFUN</h3>
<div class="outline-text-3" id="text-org4da2794">
<p>
При создании функции мы добавляем в замыкание <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orga18e24d">((equal (car exp) 'defun)         (progn
                                    (push (cons (cadr exp)
                                                (make-closure :body (cdddr exp)
                                                              :env env
                                                              :block-env block-env
                                                              :go-env go-env
                                                              :args (caddr exp)))
                                          *glob-env*)
                                    (funcall cont (cadr exp))))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org102a268">;; Тесты для DEFUN
(assert (equal 64 (progn
                    (setf *glob-env* nil)
                    (myeval '(defun alfa (x) (* x x)) nil nil nil nil #'err #'ok)
                    (prog1 (myeval '(alfa 8) nil nil nil nil #'err #'ok)
                      (setf *glob-env* nil)))))
;; Тесты на IMPLICIT-PROGN в DEFUN
(assert (equal 384 (progn
                     (setf *glob-env* nil)
                     (myeval '(let ((y 3))
                               (defun alfa (x)
                                 (setq y 6)
                                 (* x x y)))
                             nil nil nil nil #'err #'ok)
                     (prog1 (myeval '(alfa 8) nil nil nil nil #'err #'ok)
                       (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org239ed27" class="outline-3">
<h3 id="org239ed27">SETQ</h3>
<div class="outline-text-3" id="text-org239ed27">
<p>
Пробрасываем <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb87c2fa">((equal (car exp) 'setq)     (myeval (caddr exp) env block-env go-env catch-env errcont
                                     (lambda (val)
                                       (if (null (assoc (cadr exp) env))
                                           (if (null (assoc (cadr exp) *glob-env*))
                                               (push (cons (cadr exp) val)
                                                     *glob-env*)
                                               (rplacd (assoc (cadr exp) *glob-env*) val))
                                           (rplacd (assoc (cadr exp) env) val))
                                       (funcall cont val))))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org5c6dfbe">;; Тесты для SETQ
;; Проверка изменения значения локальной переменной, не затрагивая глобального окружения
(assert (equal '((2 . 2) ((alfa . 0)))
               (progn
                 (setf *glob-env* '((alfa . 0)))
                 (prog1 (list (myeval '(cons (setq alfa 2)
                                        alfa)
                                      '((alfa . 1))
                                      nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
;; Изменение значения несуществующей переменной (создание глобальной переменной)
(assert (equal '((1 . 1) ((ALFA . 1) (BETA . 222)))
               (progn
                 (setf *glob-env* '((beta . 222)))
                 (prog1 (list (myeval '(cons
                                        (setq alfa 1)
                                        alfa)
                                      nil nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
;; Изменение значения существующей глобальной переменной
(assert (equal '((1 . 1) ((BETA . 1)))
               (progn
                 (setf *glob-env* '((beta . 222)))
                 (prog1 (list (myeval '(cons
                                        (setq beta 1)
                                        beta)
                                      nil nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5fc60a" class="outline-3">
<h3 id="orgc5fc60a">LAMBDA</h3>
<div class="outline-text-3" id="text-orgc5fc60a">
<p>
При создании лямбды мы добавляем в замыкание <code>go-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org9cdae8e">((equal (car exp) 'lambda)   (funcall cont (make-closure :body (cddr exp)
                                                         :env env
                                                         :block-env block-env
                                                         :go-env go-env
                                                         :args (cadr exp))))
</pre>
</div>

<p>
Тесты получают дополнительный nil
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org5a74af8">;; Тесты для LAMBDA
(assert (equal 3 (myeval '((lambda (x) (+ 1  x)) 2)
                         nil nil nil nil #'err #'ok)))
;; Тесты для LAMBDA в окружении
(assert (equal 5 (myeval '(let ((y 3))
                           ((lambda (x) (+ y x)) 2))
                         nil nil nil nil #'err #'ok)))
;; Тесты на IMPLICIT-PROGN в LAMBDA
(assert (equal 8 (myeval '(let ((y 3))
                           ((lambda (x)
                              (setq y 6)
                              (+ y x)) 2))
                         nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
