org/lrn/lisp/lisp-6.org
** GO

При создании ~go~ мы ищем в ~go-env~ соответствующую пару по имени и вызываем
продолжение. Если такая пара не найдена - это ошибка.

#+NAME: myeval_go_6
#+BEGIN_SRC lisp
  ((equal (car exp) 'go)       (assoc-2 (cadr exp) go-env
                                        (lambda (x)
                                          (funcall x))
                                        (lambda (x)
                                          (funcall errcont (format nil "go: wrong target ~A" x)))))
#+END_SRC

Тесты

#+NAME: myeval_go_6_test
#+BEGIN_SRC lisp
  ;; Тесты для GO
  (assert (equal '(1 . 4) (myeval '(let ((alfa 0))
                                    (tagbody
                                     a (setq alfa 1)
                                     b (go d)
                                     c (setq alfa (cons alfa 3))
                                     d (setq alfa (cons alfa 4)))
                                    alfa)
                                  nil nil nil nil #'err #'ok)))
  ;; Тесты для "обратного хода" GO
  (assert (equal '(1 . 5) (myeval '(let ((alfa 0))
                                    (tagbody
                                     a (go d)
                                     b (setq alfa 1)
                                     c (go e)
                                     d (go b)
                                     e (setq alfa (cons alfa 5)))
                                    alfa)
                                  nil nil nil nil #'err #'ok)))
#+END_SRC

* REPL

#+NAME: repl_6
#+BEGIN_SRC lisp
  (defun repl ()
    (princ "microlisp>")
    (finish-output)
    (princ (myeval (read) nil #'identity #'identity))
    (terpri)
    (finish-output)
    (repl))
#+END_SRC

