www/lrn/lisp/lisp-6.html

<div id="outline-container-org15eb5a4" class="outline-3">
<h3 id="org15eb5a4">GO</h3>
<div class="outline-text-3" id="text-org15eb5a4">
<p>
При создании <code>go</code> мы ищем в <code>go-env</code> соответствующую пару по имени и вызываем
продолжение. Если такая пара не найдена - это ошибка.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgcc97d12">((equal (car exp) 'go)       (assoc-2 (cadr exp) go-env
                                      (lambda (x)
                                        (funcall x))
                                      (lambda (x)
                                        (funcall errcont (format nil "go: wrong target ~A" x)))))
</pre>
</div>

<p>
Тесты
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3dc1543">;; Тесты для GO
(assert (equal '(1 . 4) (myeval '(let ((alfa 0))
                                  (tagbody
                                   a (setq alfa 1)
                                   b (go d)
                                   c (setq alfa (cons alfa 3))
                                   d (setq alfa (cons alfa 4)))
                                  alfa)
                                nil nil nil nil #'err #'ok)))
;; Тесты для "обратного хода" GO
(assert (equal '(1 . 5) (myeval '(let ((alfa 0))
                                  (tagbody
                                   a (go d)
                                   b (setq alfa 1)
                                   c (go e)
                                   d (go b)
                                   e (setq alfa (cons alfa 5)))
                                  alfa)
                                nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
</div>
